In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
import numpy as np
import pandas as pd

In [4]:
random_num = np.random.randint(1, 101, [3, 3])
random_num

array([[50, 40, 11],
       [54, 94, 21],
       [49, 58, 20]])

In [5]:
# numpy의 ndarray를 가지고 데이터프레임을 만들면 행(row)이 인덱스가 됨
# 컬럼도 숫자가 잡힘
df_num = pd.DataFrame(random_num)
df_num

    0   1   2
0  50  40  11
1  54  94  21
2  49  58  20

In [9]:
df_num = pd.DataFrame(random_num, 
                      index=["row1", "row2", "row3"], 
                      columns=["col1", "col2", "col3"])
df_num

      col1  col2  col3
row1    50    40    11
row2    54    94    21
row3    49    58    20

In [10]:
books = {"title" : ["개미", "고구려", "드래곤라자", "퇴마록"],
         "writer" : ["베르나르베르베르", "김진명", "이영도", "이우혁"],
         "publisher" : ["열린책들", "이타북스", "황금가지", "들녁"],
         "1st-edition" : ["2013-05-30", "2011-02-28", "1998-05-30", "1994-01-01"],
         "price" : [15800, 15800, 6300, 8550]}
books

{'title': ['개미', '고구려', '드래곤라자', '퇴마록'],
 'writer': ['베르나르베르베르', '김진명', '이영도', '이우혁'],
 'publisher': ['열린책들', '이타북스', '황금가지', '들녁'],
 '1st-edition': ['2013-05-30', '2011-02-28', '1998-05-30', '1994-01-01'],
 'price': [15800, 15800, 6300, 8550]}

In [11]:
df_books = pd.DataFrame(books)
df_books

   title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녁  1994-01-01   8550

In [12]:
df_books.index
df_books.columns
df_books.shape
df_books.size

# 시리즈 별로 다른 타입을 가질 수 있음
df_books.dtypes
df_books.count()

RangeIndex(start=0, stop=4, step=1)

Index(['title', 'writer', 'publisher', '1st-edition', 'price'], dtype='object')

(4, 5)

20

title          object
writer         object
publisher      object
1st-edition    object
price           int64
dtype: object

title          4
writer         4
publisher      4
1st-edition    4
price          4
dtype: int64

In [15]:
df_books.info
type(df_books.info)

<bound method DataFrame.info of    title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녁  1994-01-01   8550>

method

In [16]:
df_books.info()
type(df_books.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   title        4 non-null      object
 1   writer       4 non-null      object
 2   publisher    4 non-null      object
 3   1st-edition  4 non-null      object
 4   price        4 non-null      int64
dtypes: int64(1), object(4)
memory usage: 288.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   title        4 non-null      object
 1   writer       4 non-null      object
 2   publisher    4 non-null      object
 3   1st-edition  4 non-null      object
 4   price        4 non-null      int64
dtypes: int64(1), object(4)
memory usage: 288.0+ bytes

NoneType

In [18]:
# 데이터프레임은 시리즈들이 여러개 모여있는 것
# title이라는 키를 넣었더니 (컬럼) 데이터 타입이 시리즈
df_books["title"]
type(df_books["title"])

0       개미
1      고구려
2    드래곤라자
3      퇴마록
Name: title, dtype: object

pandas.core.series.Series

In [19]:
df_books["title"][2]

'드래곤라자'

In [20]:
df_books["price"]

0    15800
1    15800
2     6300
3     8550
Name: price, dtype: int64

In [21]:
df_books["price"].max()

15800

In [23]:
df_books["price"].sort_values()

2     6300
3     8550
0    15800
1    15800
Name: price, dtype: int64

In [25]:
df_books.sort_values(by="price", ascending=False)

   title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
3    퇴마록       이우혁        들녁  1994-01-01   8550
2  드래곤라자       이영도      황금가지  1998-05-30   6300

In [28]:
# 가격과 초판 인쇄를 가격은 큰 것부터, 초판 인쇄는 작은 것(먼저 출판) 부터
df_books.sort_values(by=["price", "1st-edition"],
                     ascending=[False, True])

   title    writer publisher 1st-edition  price
1    고구려       김진명      이타북스  2011-02-28  15800
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
3    퇴마록       이우혁        들녁  1994-01-01   8550
2  드래곤라자       이영도      황금가지  1998-05-30   6300

In [30]:
df_books.sort_index(axis=1)

  1st-edition  price publisher  title    writer
0  2013-05-30  15800      열린책들     개미  베르나르베르베르
1  2011-02-28  15800      이타북스    고구려       김진명
2  1998-05-30   6300      황금가지  드래곤라자       이영도
3  1994-01-01   8550        들녁    퇴마록       이우혁

In [32]:
df_books.index
df_books.values

# RangeIndex(start=0, stop=4, step=1)
# start=0 0부터 시작함
# stop=4 인덱스의 종료 값
# step=1 인덱스 값 사이의 간격 1

RangeIndex(start=0, stop=4, step=1)

array([['개미', '베르나르베르베르', '열린책들', '2013-05-30', 15800],
       ['고구려', '김진명', '이타북스', '2011-02-28', 15800],
       ['드래곤라자', '이영도', '황금가지', '1998-05-30', 6300],
       ['퇴마록', '이우혁', '들녁', '1994-01-01', 8550]], dtype=object)

In [33]:
df_books["title"]

0       개미
1      고구려
2    드래곤라자
3      퇴마록
Name: title, dtype: object

In [34]:
df_books.title

0       개미
1      고구려
2    드래곤라자
3      퇴마록
Name: title, dtype: object

In [35]:
# "price"에서 가장 큰 값 3개
df_books.nlargest(3, columns="price")

  title    writer publisher 1st-edition  price
0    개미  베르나르베르베르      열린책들  2013-05-30  15800
1   고구려       김진명      이타북스  2011-02-28  15800
3   퇴마록       이우혁        들녁  1994-01-01   8550

In [37]:
# "price"에서 가장 작은 값 3개
df_books.nsmallest(3, columns="price")

   title    writer publisher 1st-edition  price
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녁  1994-01-01   8550
0     개미  베르나르베르베르      열린책들  2013-05-30  15800

In [40]:
df_books.price.sum()
type(df_books.price.sum())

46450

numpy.int64

In [48]:
# 인덱스를 타이틀로 바꿈
df_title = df_books.set_index("title")
df_title

         writer publisher 1st-edition  price
title
개미     베르나르베르베르      열린책들  2013-05-30  15800
고구려         김진명      이타북스  2011-02-28  15800
드래곤라자       이영도      황금가지  1998-05-30   6300
퇴마록         이우혁        들녁  1994-01-01   8550

In [46]:
# 인덱스에 이름을 붙였기 때문에
df_books["writer"][1]
df_title["writer"]["고구려"]

'김진명'

'김진명'

In [47]:
df_books
df_title

   title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녁  1994-01-01   8550

         writer publisher 1st-edition  price
title
개미     베르나르베르베르      열린책들  2013-05-30  15800
고구려         김진명      이타북스  2011-02-28  15800
드래곤라자       이영도      황금가지  1998-05-30   6300
퇴마록         이우혁        들녁  1994-01-01   8550

In [52]:
# 다시 숫자 인덱스로 되돌리고 싶을 때
df_title.reset_index()

   title    writer publisher 1st-edition  price
0     개미  베르나르베르베르      열린책들  2013-05-30  15800
1    고구려       김진명      이타북스  2011-02-28  15800
2  드래곤라자       이영도      황금가지  1998-05-30   6300
3    퇴마록       이우혁        들녁  1994-01-01   8550

In [54]:
# 숫자값 컬럼이 하나일 경우에 숫자만 더함
df_title.sum(numeric_only=True)

price    46450
dtype: int64

In [56]:
df_title.median(numeric_only=True)

price    12175.0
dtype: float64

In [57]:
df_title["1st-edition"]

title
개미       2013-05-30
고구려      2011-02-28
드래곤라자    1998-05-30
퇴마록      1994-01-01
Name: 1st-edition, dtype: object

In [58]:
pd.to_datetime(df_title["1st-edition"])

title
개미      2013-05-30
고구려     2011-02-28
드래곤라자   1998-05-30
퇴마록     1994-01-01
Name: 1st-edition, dtype: datetime64[ns]

In [59]:
df_title.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 개미 to 퇴마록
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   writer       4 non-null      object
 1   publisher    4 non-null      object
 2   1st-edition  4 non-null      object
 3   price        4 non-null      int64
dtypes: int64(1), object(3)
memory usage: 332.0+ bytes

In [60]:
df_title["1st-edition"] = pd.to_datetime(df_title["1st-edition"])

In [61]:
df_title.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 개미 to 퇴마록
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   writer       4 non-null      object
 1   publisher    4 non-null      object
 2   1st-edition  4 non-null      datetime64[ns]
 3   price        4 non-null      int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 332.0+ bytes

In [62]:
df_title.select_dtypes("object")

         writer publisher
title
개미     베르나르베르베르      열린책들
고구려         김진명      이타북스
드래곤라자       이영도      황금가지
퇴마록         이우혁        들녁

In [63]:
df_title.select_dtypes(include="object")

         writer publisher
title
개미     베르나르베르베르      열린책들
고구려         김진명      이타북스
드래곤라자       이영도      황금가지
퇴마록         이우혁        들녁

In [64]:
df_title.select_dtypes(exclude="object")

      1st-edition  price
title
개미     2013-05-30  15800
고구려    2011-02-28  15800
드래곤라자  1998-05-30   6300
퇴마록    1994-01-01   8550

In [66]:
df_title

         writer publisher 1st-edition  price
title
개미     베르나르베르베르      열린책들  2013-05-30  15800
고구려         김진명      이타북스  2011-02-28  15800
드래곤라자       이영도      황금가지  1998-05-30   6300
퇴마록         이우혁        들녁  1994-01-01   8550

In [70]:
# 여러 개의 컬럼을 가지고 오고 싶을 때 : 리스트 형식으로
df_title[["writer", "price"]]

         writer  price
title
개미     베르나르베르베르  15800
고구려         김진명  15800
드래곤라자       이영도   6300
퇴마록         이우혁   8550

In [73]:
# 시리즈 (1차원)
df_title["writer"]
type(df_title["writer"])

title
개미       베르나르베르베르
고구려           김진명
드래곤라자         이영도
퇴마록           이우혁
Name: writer, dtype: object

pandas.core.series.Series

In [74]:
# 데이터 프레임 (2차원)
df_title[["writer"]]
type(df_title[["writer"]])

         writer
title
개미     베르나르베르베르
고구려         김진명
드래곤라자       이영도
퇴마록         이우혁

pandas.core.frame.DataFrame

In [75]:
# 컬럼이 아니라 인덱스로 찾을 때 location
df_title.loc["드래곤라자"]

writer                         이영도
publisher                     황금가지
1st-edition    1998-05-30 00:00:00
price                         6300
Name: 드래곤라자, dtype: object

In [78]:
df_title

         writer publisher 1st-edition  price
title
개미     베르나르베르베르      열린책들  2013-05-30  15800
고구려         김진명      이타북스  2011-02-28  15800
드래곤라자       이영도      황금가지  1998-05-30   6300
퇴마록         이우혁        들녁  1994-01-01   8550

In [80]:
# 여러개 가져올 땐 대괄호로!
df_title.loc[["드래곤라자", "퇴마록"]]

      writer publisher 1st-edition  price
title
드래곤라자    이영도      황금가지  1998-05-30   6300
퇴마록      이우혁        들녁  1994-01-01   8550

In [83]:
# iloc : index location 해당 인덱스의 번지
df_title.iloc[0]

writer                    베르나르베르베르
publisher                     열린책들
1st-edition    2013-05-30 00:00:00
price                        15800
Name: 개미, dtype: object

In [84]:
df_title.iloc[2:4]

      writer publisher 1st-edition  price
title
드래곤라자    이영도      황금가지  1998-05-30   6300
퇴마록      이우혁        들녁  1994-01-01   8550